; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v5 ?v7)
             (pred_2 ?v11 ?v13)
             (pred_1 ?v5 ?v13)
             (pred_8 ?v3 ?v5 )
	     (pred_5 ?v5)
             (pred_12 ?v4)
             (pred_10 ?v11)
             (pred_7 ?v13)
             (pred_11 ?v5)
             (pred_9 ?v11)
             (pred_3 ?v5)
             (pred_4 ))



(:action op_4
:parameters (?v12 ?v10 ?v9 ?v6)
:precondition (and (pred_12 ?v12) (pred_12 ?v10) (pred_10 ?v9) (pred_7 ?v6)
          (pred_6 ?v12 ?v10) (pred_2 ?v9 ?v6)
                   (pred_1 ?v10 ?v6) (pred_5 ?v12) 
                   (pred_11 ?v10) (pred_9 ?v9))
:effect (and  (pred_3 ?v10) (not (pred_11 ?v10))))


(:action op_5
:parameters (?v12 ?v1)
:precondition (and (pred_12 ?v12) (pred_12 ?v1)
               (pred_5 ?v12) (pred_6 ?v12 ?v1) (pred_3 ?v1))
:effect (and (pred_5 ?v1) (not (pred_5 ?v12))))

(:action op_3
:parameters (?v12 ?v9)
:precondition (and (pred_12 ?v12) (pred_10 ?v9) 
                  (pred_5 ?v12) (pred_8 ?v9 ?v12) (pred_4 ))
:effect (and (pred_9 ?v9)
   (not (pred_8 ?v9 ?v12)) (not (pred_4 ))))


(:action op_2
:parameters (?v12 ?v2 ?v8)
:precondition (and (pred_12 ?v12) (pred_10 ?v2) (pred_10 ?v8)
                  (pred_5 ?v12) (pred_9 ?v8) (pred_8 ?v2 ?v12))
:effect (and (pred_9 ?v2) (pred_8 ?v8 ?v12)
        (not (pred_9 ?v8)) (not (pred_8 ?v2 ?v12))))

(:action op_1
:parameters (?v12 ?v9)
:precondition (and (pred_12 ?v12) (pred_10 ?v9) 
                  (pred_5 ?v12) (pred_9 ?v9))
:effect (and (pred_4 ) (pred_8 ?v9 ?v12) (not (pred_9 ?v9)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_06 obj_29 obj_20 obj_27 obj_04 obj_10 obj_31 obj_05 obj_07 obj_16 obj_24 obj_18 obj_01 obj_14 obj_30 obj_03 obj_08 obj_02 obj_26 obj_17 obj_23 obj_28 obj_21 obj_25
    obj_19 obj_15 obj_22
    obj_09 obj_11 obj_13
    )

    (:init
       (pred_4)

       (pred_12 obj_12)
       (pred_12 obj_06)
       (pred_12 obj_29)
       (pred_12 obj_20)
       (pred_12 obj_27)
       (pred_12 obj_04)
       (pred_12 obj_10)
       (pred_12 obj_31)
       (pred_12 obj_05)
       (pred_12 obj_07)
       (pred_12 obj_16)
       (pred_12 obj_24)
       (pred_12 obj_18)
       (pred_12 obj_01)
       (pred_12 obj_14)
       (pred_12 obj_30)
       (pred_12 obj_03)
       (pred_12 obj_08)
       (pred_12 obj_02)
       (pred_12 obj_26)
       (pred_12 obj_17)
       (pred_12 obj_23)
       (pred_12 obj_28)
       (pred_12 obj_21)
       (pred_12 obj_25)
       (pred_7 obj_19)
       (pred_7 obj_15)
       (pred_7 obj_22)
       (pred_10 obj_09)
       (pred_10 obj_11)
       (pred_10 obj_13)

       (pred_6 obj_12 obj_04)
       (pred_6 obj_12 obj_06)
       (pred_6 obj_06 obj_10)
       (pred_6 obj_06 obj_29)
       (pred_6 obj_06 obj_12)
       (pred_6 obj_29 obj_31)
       (pred_6 obj_29 obj_20)
       (pred_6 obj_29 obj_06)
       (pred_6 obj_20 obj_05)
       (pred_6 obj_20 obj_27)
       (pred_6 obj_20 obj_29)
       (pred_6 obj_27 obj_07)
       (pred_6 obj_27 obj_20)
       (pred_6 obj_04 obj_16)
       (pred_6 obj_04 obj_10)
       (pred_6 obj_04 obj_12)
       (pred_6 obj_10 obj_24)
       (pred_6 obj_10 obj_31)
       (pred_6 obj_10 obj_06)
       (pred_6 obj_10 obj_04)
       (pred_6 obj_31 obj_18)
       (pred_6 obj_31 obj_05)
       (pred_6 obj_31 obj_29)
       (pred_6 obj_31 obj_10)
       (pred_6 obj_05 obj_01)
       (pred_6 obj_05 obj_07)
       (pred_6 obj_05 obj_20)
       (pred_6 obj_05 obj_31)
       (pred_6 obj_07 obj_14)
       (pred_6 obj_07 obj_27)
       (pred_6 obj_07 obj_05)
       (pred_6 obj_16 obj_30)
       (pred_6 obj_16 obj_24)
       (pred_6 obj_16 obj_04)
       (pred_6 obj_24 obj_03)
       (pred_6 obj_24 obj_18)
       (pred_6 obj_24 obj_10)
       (pred_6 obj_24 obj_16)
       (pred_6 obj_18 obj_08)
       (pred_6 obj_18 obj_01)
       (pred_6 obj_18 obj_31)
       (pred_6 obj_18 obj_24)
       (pred_6 obj_01 obj_02)
       (pred_6 obj_01 obj_14)
       (pred_6 obj_01 obj_05)
       (pred_6 obj_01 obj_18)
       (pred_6 obj_14 obj_26)
       (pred_6 obj_14 obj_07)
       (pred_6 obj_14 obj_01)
       (pred_6 obj_30 obj_17)
       (pred_6 obj_30 obj_03)
       (pred_6 obj_30 obj_16)
       (pred_6 obj_03 obj_23)
       (pred_6 obj_03 obj_08)
       (pred_6 obj_03 obj_24)
       (pred_6 obj_03 obj_30)
       (pred_6 obj_08 obj_28)
       (pred_6 obj_08 obj_02)
       (pred_6 obj_08 obj_18)
       (pred_6 obj_08 obj_03)
       (pred_6 obj_02 obj_21)
       (pred_6 obj_02 obj_26)
       (pred_6 obj_02 obj_01)
       (pred_6 obj_02 obj_08)
       (pred_6 obj_26 obj_25)
       (pred_6 obj_26 obj_14)
       (pred_6 obj_26 obj_02)
       (pred_6 obj_17 obj_23)
       (pred_6 obj_17 obj_30)
       (pred_6 obj_23 obj_28)
       (pred_6 obj_23 obj_03)
       (pred_6 obj_23 obj_17)
       (pred_6 obj_28 obj_21)
       (pred_6 obj_28 obj_08)
       (pred_6 obj_28 obj_23)
       (pred_6 obj_21 obj_25)
       (pred_6 obj_21 obj_02)
       (pred_6 obj_21 obj_28)
       (pred_6 obj_25 obj_26)
       (pred_6 obj_25 obj_21)
       (pred_11 obj_25)
       (pred_11 obj_29)
       (pred_11 obj_31)
       (pred_1  obj_25 obj_19)
       (pred_1  obj_29 obj_15)
       (pred_1  obj_31 obj_22)
       (pred_3 obj_12)
       (pred_3 obj_06)
       (pred_3 obj_20)
       (pred_3 obj_27)
       (pred_3 obj_04)
       (pred_3 obj_10)
       (pred_3 obj_05)
       (pred_3 obj_07)
       (pred_3 obj_16)
       (pred_3 obj_24)
       (pred_3 obj_18)
       (pred_3 obj_01)
       (pred_3 obj_14)
       (pred_3 obj_30)
       (pred_3 obj_03)
       (pred_3 obj_08)
       (pred_3 obj_02)
       (pred_3 obj_26)
       (pred_3 obj_17)
       (pred_3 obj_23)
       (pred_3 obj_28)
       (pred_3 obj_21)

       (pred_2  obj_09 obj_19)
       (pred_2  obj_11 obj_15)
       (pred_2  obj_13 obj_22)
       (pred_8 obj_09 obj_05)
       (pred_8 obj_11 obj_14)
       (pred_8 obj_13 obj_29)
       (pred_5 obj_14)
    )

    (:goal (and
       (pred_8 obj_09 obj_02)
       (pred_8 obj_11 obj_23)
    ))
(:constraints
  (always (not (pred_5 obj_01)))
)
)

; plan
1. (op_3 obj_14 obj_11)
   deleted: (pred_8 obj_11 obj_14) (pred_4)
   added: (pred_9 obj_11)
   goals met: 0 of 2
2. (op_5 obj_14 obj_07)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_07)
   goals met: 0 of 2
3. (op_1 obj_07 obj_11)
   deleted: (pred_9 obj_11)
   added: (pred_4) (pred_8 obj_11 obj_07)
   goals met: 0 of 2
4. (op_5 obj_07 obj_05)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_05)
   goals met: 0 of 2
5. (op_3 obj_05 obj_09)
   deleted: (pred_8 obj_09 obj_05) (pred_4)
   added: (pred_9 obj_09)
   goals met: 0 of 2
6. (op_5 obj_05 obj_07)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_07)
   goals met: 0 of 2
7. (op_5 obj_07 obj_14)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_14)
   goals met: 0 of 2
8. (op_5 obj_14 obj_26)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_26)
   goals met: 0 of 2
9. (op_5 obj_26 obj_02)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_02)
   goals met: 0 of 2
10. (op_1 obj_02 obj_09)
   deleted: (pred_9 obj_09)
   added: (pred_4) (pred_8 obj_09 obj_02)
   goals met: 1 of 2
11. (op_5 obj_02 obj_26)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_26)
   goals met: 1 of 2
12. (op_5 obj_26 obj_14)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_14)
   goals met: 1 of 2
13. (op_5 obj_14 obj_07)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_07)
   goals met: 1 of 2
14. (op_3 obj_07 obj_11)
   deleted: (pred_8 obj_11 obj_07) (pred_4)
   added: (pred_9 obj_11)
   goals met: 1 of 2
15. (op_5 obj_07 obj_14)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_14)
   goals met: 1 of 2
16. (op_5 obj_14 obj_26)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_26)
   goals met: 1 of 2
17. (op_5 obj_26 obj_02)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_02)
   goals met: 1 of 2
18. (op_5 obj_02 obj_08)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_08)
   goals met: 1 of 2
19. (op_5 obj_08 obj_03)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_03)
   goals met: 1 of 2
20. (op_5 obj_03 obj_23)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_23)
   goals met: 1 of 2
21. (op_1 obj_23 obj_11)
   deleted: (pred_9 obj_11)
   added: (pred_4) (pred_8 obj_11 obj_23)
   goals met: 2 of 2
